In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('singapore_trip_advisor_data.csv')

In [6]:
# initially we had 126,021 reviews 
df.shape

(126021, 13)

In [7]:
# review index to check duplicity
# review date - no use yet
# review rating - can act like proxy review sentiment 
# review title - sentiment analysis possible. try keyword extraction
# review body - sentiment analysis, keyword extraction
# date of experience - no use yet
# trip type - for recommendations
# review crawled - useless
# reviewer name -  useless
# home coutry - for recommendations (but missing data problem)
# attraction name - important
# attraction type - important
df.columns

Index(['REVIEW_INDEX', 'REVIEW_DATE', 'REVIEW_RATING', 'REVIEW_TITLE',
       'REVIEW_BODY', 'DATE_OF_EXPERIENCE', 'TRIP_TYPE', 'REVIEW_CRAWLED_TIME',
       'REVIEWER_NAME', 'HOME_COUNTRY', 'ATTRACTION_NAME', 'ATTRACTION_TYPE',
       'ADDRESS'],
      dtype='object')

In [5]:
# lot of missing home country data
df.isnull().sum()

REVIEW_INDEX               0
REVIEW_DATE                0
REVIEW_RATING              0
REVIEW_TITLE               5
REVIEW_BODY               11
DATE_OF_EXPERIENCE        36
TRIP_TYPE                  0
REVIEW_CRAWLED_TIME        0
REVIEWER_NAME              6
HOME_COUNTRY           22208
ATTRACTION_NAME            0
ATTRACTION_TYPE            0
ADDRESS                    0
dtype: int64

In [13]:
# no review duplicity
df['REVIEW_INDEX'].nunique()

126021

In [25]:
# there was review text duplicity but because user wrote exact same review for multiple places they visited
df['REVIEW_BODY'].nunique()

125904

In [32]:
# loose only 47 reviews if drop NaN - will drop

# df[df['REVIEW_BODY'].isnull()]
# df[df['REVIEW_TITLE'].isnull()]

In [42]:
# number of reviews for each attraction
df['ATTRACTION_NAME'].value_counts().to_frame()
# 68 unique attractions

# do we have a cut off for number of reviews to consider an attraction for our model??

                                       ATTRACTION_NAME
Gardens by the Bay                               28749
Singapore Zoo                                     8213
Singapore Botanic Gardens                         7556
Cloud Forest                                      7317
Marina Bay Sands Skypark                          6295
...                                                ...
Lee Kong Chian Natural History Museum               74
Kuan Yin Thong Hood Cho Temple                      51
Faber Peak                                          44
Katong District                                     29
Kusu Island                                         25

[68 rows x 1 columns]

In [41]:
df['ATTRACTION_TYPE'].value_counts().to_frame()

                        ATTRACTION_TYPE
Leisure & Recreation              72982
Nature & Wildlife                 18933
Precinct & Street                 18794
Art, History & Culture            15312

In [44]:
# review distribution

df['REVIEW_RATING'].value_counts().to_frame()

   REVIEW_RATING
5          79465
4          34275
3           9188
2           1891
1           1202

In [54]:
# we can limit our recommendations for bigger markets
country_dist = df['HOME_COUNTRY'].value_counts().to_frame()
# 13 country visitors with over 1000 reviews
# 19 with over 500
# need to decide cut - off
country_dist[country_dist['HOME_COUNTRY'] > 1000]

                      HOME_COUNTRY
Australia                    22582
United Kingdom               17801
Singapore                    13172
India                        10537
United States                 9930
New Zealand                   2766
Indonesia                     2513
Canada                        2338
Philippines                   2049
Malaysia                      1971
China                         1488
Thailand                      1317
United Arab Emirates          1058

In [58]:
df['TRIP_TYPE'].value_counts().to_frame()

          TRIP_TYPE
Couples       49678
Family        38327
Friends       20214
Solo          13021
Business       4781

In [1]:
# proposal 1: To design top 5/10 attractions and 1 Attraction type for a segement based on home country, trip type

# proposal 2: what exactly about an attraction people like or dislike

# proposal 3: Rating Prediction



## To do list

# Topic Modeling on Reviews

# Sentiment analysis on review title and body
# does rating fairly reflect sentiment ?

In [ ]:
# can add review length column